{t alias="Каталог товаров. Описание раздела"}Данный раздел позволяет управлять товарами и категориями товаров в системе.<br>
Каждый товар может быть определен в одну или несколько категорий одновременно. Существует 3 типа категорий:
<p></p>
<ul>
    <li><i>Обычная категория</i> - подсвечивается черным цветом, объединяет товары по какому-либо признаку</li>
    <li><i>Спецкатегория</i> - подсвечивается красным цветом, наделяет товары, находящиеся в этой категории определенными ярлыками. Например: "Новинка", "Популярный", и.т.д. Спецкатегория должна размещаться только в корне дерева категорий.</li>
    <li><i>Виртуальная категория</i> - посвечивается зеленым цветом, является категорией, у которой включен подбор товаров из других категорий по заданному условию.</li>
</ul>
<p>Настройте у обычных категорий характеристики, которые присущи всем товарам данной категории. В этом случае, при переходе в данную категорию, вы сможете фильтровать товары в административной панели по установленным характеристикам, а также добавлять к экспорту в CSV колонки со связанными с категорией характеристиками.</p>

<p>Установите флажок "Отображать в поиске на сайте" напротив необходимой характеристики на вкладке "Характеристики" в форме редактирования обычной категории. В этом случае, если у товаров будет как минимум 2 различных значения данной характеристики, то она отобразится в фильтре на сайте в этой категории.</p>

<p>Используйте иконку шестеренки в шапке таблицы, чтобы настроить отображение необходимых для вас колонок в таблице товаров. Включение некоторых колонок для отображения в таблице, автоматически включает возможность фильтрации по ним (Например, это относится к колонкам, связанным с ценами).</p>{/t}
