{t varTitle="%{ldelim}ticket.title{rdelim}"
varNumber="%{ldelim}ticket.number{rdelim}"
varSignature="%{ldelim}signature{rdelim}"}<p>Уважаемый клиент!</p>

<p>Благодарим Вас за обращение в службу технической поддержки компании ReadyScript.<br>
Ваше обращение с темой "%varTitle" принято.</p>

<p>Ему присвоен номер #%varNumber и, если в дальнейшем Вы
    будете связываться с нами по данному вопросу, просьба его указать в теме письма.</p>

<p>Все письма регистрируются и обрабатываются в порядке очереди, мы
приступим к решению Вашего вопроса максимально оперативно.
Как только он будет решен, мы ответим Вам.
При необходимости в дополнительной информации наш сотрудник
свяжется с Вами дополнительно.</p>

<p>Это автоматически созданное сообщение, просьба не отвечать на него.</p>

<p>%varSignature</p>{/t}