<div
  id="addtocart-button"
  class="item-card__price-wrap "
  [ngClass]="product.isNeedAdultButtonShow() ? 'item-card__price-button_adult' :
  product['amountInCart'] && !product.isOffersUse() || productInCard && !product.isOffersUse() ? 'item-card__price-button_count' : ''"
>
  <div class="item-card__price-old" *ngIf="product.getOldCost() && !product.isReservationButtonShow()">
    <span class="item-card-old-price">{ { product.getOldCost() } }</span>
    <span class="item-card__discount" *ngIf="product.getDiscountPercent()">
      - <span [innerHTML]="product.getDiscountPercent()"></span>%
    </span>
  </div>
  <div class="item-card__cart-attr">
    <div
      class="item-card__price item-card__price_sale"
      [ngClass]="product.getCost() == '{t}Цена по запросу{/t}' || product.getCost() == '{t}Нет цены{/t}' || product.getCost() == '{t}Снято с продаж{/t}' ? 'item-card__price-text' : ''"
      {if $client_version < 3.7}
        *ngIf="product.getCost() && ( product.isBuyButtonShow() || product.isNotStocksButtonShow() )"
      {else}
        *ngIf="product.getCost() && (( product.isBuyButtonShow() || product.isNotStocksButtonShow() ) || product.isReservationButtonShow())"
      {/if}
    >
      <span class="item-card-old-price">{ { product.getCost() } }</span>
    </div>
  </div>
  {if $client_version < 3.7}
    <div class="item-card__price" *ngIf="product.getCost() &&  product.isReservationButtonShow()">
      <span class="item-card-old-price" [innerHTML]="product.getCost()"></span>
    </div>
  {/if}

  <div
    class="item-card__button-wrap"
    {if $client_version < 3.7}
      [ngClass]="product.isReservationButtonShow() ? 'item-card__price-button_reservation' : ''"
    {/if}
  >
    <div class="item-card__cart-attr-buttons">
      <div class="item-card__buttons">
        <div *ngIf="product.isNeedAdultButtonShow()">
          <button type="button" class="item-card__notify" disabled>{t}Только в магазинах{/t}</button>
        </div>
        <div *ngIf="!product.isNeedAdultButtonShow()">
          <button
            type="button"
            class="item-card__to-cart"
            *ngIf="product.isBuyButtonShow({if $client_version >= 3.7}true{/if})"
            (click)="(product.offers.length > 1) ? openAddToCart(product) : addToCart(product)"
          >
            <svg width="24" height="18" viewBox="0 0 24 18" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M2.9195 11.5445C2.9195 11.7961 3.12343 12 3.375 12C3.62657 12 3.83051 11.7961 3.83051 11.5445V9.0782H6.2968C6.5471 9.0782 6.75 8.87529 6.75 8.625C6.75 8.37471 6.5471 8.1718 6.2968 8.1718H3.83051V5.7055C3.83051 5.45394 3.62657 5.25 3.375 5.25C3.12343 5.25 2.9195 5.45394 2.9195 5.7055V8.1718H0.453199C0.202904 8.1718 0 8.37471 0 8.625C0 8.87529 0.202904 9.0782 0.453199 9.0782H2.9195V11.5445Z" fill="white"/>
              <path fill-rule="evenodd" clip-rule="evenodd" d="M11.1735 12.0766C11.1735 11.9524 11.2742 11.8516 11.3985 11.8516H21.9857C23.095 11.8516 24 11.2496 24 10.125V6C24 5.25 23.3852 5.11813 23.0147 5.0663L11.5002 3.45117C11.3149 3.42525 11.1771 3.26681 11.1771 3.07979V1.81443C11.1771 1.51423 10.9981 1.24294 10.7221 1.12487L8.18489 0.0395371C7.9331 -0.0677448 7.64482 0.0506352 7.539 0.305892C7.43318 0.561149 7.54995 0.853399 7.80173 0.960681L9.73324 1.78705C10.0092 1.90513 10.1882 2.1764 10.1882 2.47659V12.9245C10.1882 13.841 10.7882 14.6185 11.6114 14.8751C11.7654 14.9231 11.8535 15.1035 11.7954 15.254C11.7078 15.4808 11.6588 15.7272 11.6588 15.9838C11.6588 17.0974 12.5528 18 13.6476 18C14.7423 18 15.6363 17.0937 15.6363 15.9838C15.6363 15.7539 15.5982 15.5311 15.5274 15.3243C15.4709 15.1595 15.583 14.9665 15.7572 14.9665H19.4005C19.5742 14.9665 19.6858 15.158 19.6291 15.3223C19.5575 15.5299 19.5189 15.7525 19.5189 15.9838C19.5189 17.0974 20.413 18 21.5077 18C22.6024 18 23.4964 17.0937 23.4964 15.9838C23.4964 14.874 22.6024 13.9677 21.5077 13.9677H12.2025C11.6333 13.9677 11.1735 13.4979 11.1735 12.9245V12.0766ZM13.6512 16.9975C14.2022 16.9975 14.6547 16.5424 14.6547 15.9801C14.6547 15.4178 14.2022 14.9628 13.6512 14.9628C13.1002 14.9628 12.6477 15.4215 12.6477 15.9801C12.6477 16.5387 13.1002 16.9975 13.6512 16.9975ZM21.5113 16.9975C22.0623 16.9975 22.5148 16.5424 22.5148 15.9801C22.5148 15.4178 22.0623 14.9628 21.5113 14.9628C20.9603 14.9628 20.5078 15.4215 20.5078 15.9801C20.5078 16.5387 20.9603 16.9975 21.5113 16.9975ZM12.2025 10.875H21.9857C22.5513 10.875 23.0147 10.7058 23.0147 10.125V6.55823C23.0147 6.1841 22.7119 5.90427 22.3413 5.85253L12 4.60457C11.5002 4.5 11.1735 4.60457 11.1735 5.27421V9.80959C11.1771 10.875 11.25 10.875 12.2025 10.875Z" fill="white"/>
            </svg>
          </button>

          <button
            type="button"
            class="item-card__notify"
            *ngIf="product.isReservationButtonShow()"
            (click)="openReservation(product)"
            {if $client_version < 3.7}
              [innerHTML]="product.getCost() == '{t}Цена по запросу{/t}' ? '{t}Узнать цену{/t}' : '{t}Уведомить о поступлении{/t}'"
            {/if}
          >
            {if $client_version >= 3.7}
              <svg width="37" height="18" viewBox="0 0 37 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path fill-rule="evenodd" clip-rule="evenodd" d="M19.898 16.1022C19.898 15.9365 20.0323 15.8022 20.198 15.8022H34.3143C35.7934 15.8022 37 14.9995 37 13.5V8C37 7 36.1803 6.82417 35.6863 6.75506L20.3336 4.60156C20.0866 4.567 19.9028 4.35575 19.9028 4.10638V2.41924C19.9028 2.01897 19.6642 1.65726 19.2961 1.49983L15.9132 0.0527161C15.5775 -0.0903264 15.1931 0.0675136 15.052 0.407856C14.9109 0.748199 15.0666 1.13787 15.4023 1.28091L17.9777 2.38273C18.3456 2.54017 18.5843 2.90187 18.5843 3.30212V17.2326C18.5843 18.4546 19.3842 19.4913 20.4818 19.8335C20.6872 19.8975 20.8046 20.138 20.7271 20.3387C20.6104 20.6411 20.5451 20.9696 20.5451 21.3118C20.5451 22.7965 21.7371 24 23.1967 24C24.6564 24 25.8484 22.7915 25.8484 21.3118C25.8484 21.0052 25.7977 20.7081 25.7032 20.4325C25.6278 20.2126 25.7773 19.9554 26.0097 19.9554H30.8673C31.099 19.9554 31.2478 20.2107 31.1722 20.4297C31.0766 20.7065 31.0252 21.0034 31.0252 21.3118C31.0252 22.7965 32.2173 24 33.6769 24C35.1365 24 36.3286 22.7915 36.3286 21.3118C36.3286 19.832 35.1365 18.6236 33.6769 18.6236H21.27C20.511 18.6236 19.898 17.9971 19.898 17.2326V16.1022ZM23.2016 22.6633C23.9363 22.6633 24.5396 22.0566 24.5396 21.3069C24.5396 20.5571 23.9363 19.9504 23.2016 19.9504C22.4669 19.9504 21.8636 20.562 21.8636 21.3069C21.8636 22.0517 22.4669 22.6633 23.2016 22.6633ZM33.6818 22.6633C34.4165 22.6633 35.0198 22.0566 35.0198 21.3069C35.0198 20.5571 34.4165 19.9504 33.6818 19.9504C32.9471 19.9504 32.3438 20.562 32.3438 21.3069C32.3438 22.0517 32.9471 22.6633 33.6818 22.6633ZM21.27 14.5H34.3143C35.0684 14.5 35.6863 14.2744 35.6863 13.5V8.74431C35.6863 8.24546 35.2825 7.87237 34.7884 7.80337L21 6.13942C20.3336 6 19.898 6.13942 19.898 7.03228V13.0794C19.9028 14.5 20 14.5 21.27 14.5Z" fill="var(--rs-color-primary)"/>
                <path d="M5 20.0111L5.01 20" stroke="var(--rs-color-primary)" stroke-width="2.5" stroke-linecap="round" stroke-linejoin="round"/>
                <path d="M1 8.78695C1 3.73766 9 3.73771 9 8.78695C9 12.3935 5.36364 11.6721 5.36364 16" stroke="var(--rs-color-primary)" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
              </svg>
            {/if}
          </button>

          <button
            type="button"
            class="item-card__to-cart"
            *ngIf="product.isNotStocksButtonShow()"
            disabled
          >
            <svg width="24" height="18" viewBox="0 0 24 18" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M2.9195 11.5445C2.9195 11.7961 3.12343 12 3.375 12C3.62657 12 3.83051 11.7961 3.83051 11.5445V9.0782H6.2968C6.5471 9.0782 6.75 8.87529 6.75 8.625C6.75 8.37471 6.5471 8.1718 6.2968 8.1718H3.83051V5.7055C3.83051 5.45394 3.62657 5.25 3.375 5.25C3.12343 5.25 2.9195 5.45394 2.9195 5.7055V8.1718H0.453199C0.202904 8.1718 0 8.37471 0 8.625C0 8.87529 0.202904 9.0782 0.453199 9.0782H2.9195V11.5445Z" fill="white"/>
              <path fill-rule="evenodd" clip-rule="evenodd" d="M11.1735 12.0766C11.1735 11.9524 11.2742 11.8516 11.3985 11.8516H21.9857C23.095 11.8516 24 11.2496 24 10.125V6C24 5.25 23.3852 5.11813 23.0147 5.0663L11.5002 3.45117C11.3149 3.42525 11.1771 3.26681 11.1771 3.07979V1.81443C11.1771 1.51423 10.9981 1.24294 10.7221 1.12487L8.18489 0.0395371C7.9331 -0.0677448 7.64482 0.0506352 7.539 0.305892C7.43318 0.561149 7.54995 0.853399 7.80173 0.960681L9.73324 1.78705C10.0092 1.90513 10.1882 2.1764 10.1882 2.47659V12.9245C10.1882 13.841 10.7882 14.6185 11.6114 14.8751C11.7654 14.9231 11.8535 15.1035 11.7954 15.254C11.7078 15.4808 11.6588 15.7272 11.6588 15.9838C11.6588 17.0974 12.5528 18 13.6476 18C14.7423 18 15.6363 17.0937 15.6363 15.9838C15.6363 15.7539 15.5982 15.5311 15.5274 15.3243C15.4709 15.1595 15.583 14.9665 15.7572 14.9665H19.4005C19.5742 14.9665 19.6858 15.158 19.6291 15.3223C19.5575 15.5299 19.5189 15.7525 19.5189 15.9838C19.5189 17.0974 20.413 18 21.5077 18C22.6024 18 23.4964 17.0937 23.4964 15.9838C23.4964 14.874 22.6024 13.9677 21.5077 13.9677H12.2025C11.6333 13.9677 11.1735 13.4979 11.1735 12.9245V12.0766ZM13.6512 16.9975C14.2022 16.9975 14.6547 16.5424 14.6547 15.9801C14.6547 15.4178 14.2022 14.9628 13.6512 14.9628C13.1002 14.9628 12.6477 15.4215 12.6477 15.9801C12.6477 16.5387 13.1002 16.9975 13.6512 16.9975ZM21.5113 16.9975C22.0623 16.9975 22.5148 16.5424 22.5148 15.9801C22.5148 15.4178 22.0623 14.9628 21.5113 14.9628C20.9603 14.9628 20.5078 15.4215 20.5078 15.9801C20.5078 16.5387 20.9603 16.9975 21.5113 16.9975ZM12.2025 10.875H21.9857C22.5513 10.875 23.0147 10.7058 23.0147 10.125V6.55823C23.0147 6.1841 22.7119 5.90427 22.3413 5.85253L12 4.60457C11.5002 4.5 11.1735 4.60457 11.1735 5.27421V9.80959C11.1771 10.875 11.25 10.875 12.2025 10.875Z" fill="white"/>
            </svg>
          </button>

          </div>
        </div>

        <div class="item-card__amount">
          <div class="cart-amount cart-amount_card">
            <button
              type="button"
              (click)="decreaseQuantityCartItem(product)"
            >
              <svg width="12" height="12" viewBox="0 0 12 12" xmlns="http://www.w3.org/2000/svg">
                <path d="M10.4752 6.46875H1.47516V4.96875H10.4752V6.46875Z"/>
              </svg>
            </button>
            <div class="cart-amount__input" (click)="openSetAmount(product)">
              <span [innerHTML]="product.amountInCart"></span>
              <span *ngIf="product.getUnitLiter()" [innerHTML]="product.getUnitLiter()"></span>
            </div>
            <button
              type="button"
              (click)="increaseQuantityCartItem(product)"
            >
              <svg width="12" height="12" viewBox="0 0 12 12" xmlns="http://www.w3.org/2000/svg">
                <path d="M10.7326 6.94364H6.87549V10.8008H5.58978V6.94364H1.73264V5.65792H5.58978V1.80078H6.87549V5.65792H10.7326V6.94364Z"/>
              </svg>
            </button>
          </div>
        </div>
      </div>
    </div>
</div>
