{t alias="Пользовательское соглашение"
    setup_domain = $Setup.DOMAIN
    firm_name = $CONFIG.firm_name
    firm_inn = $CONFIG.firm_inn
    firm_address = $CONFIG.firm_address
}
<h2>ПОЛИТИКА ИСПОЛЬЗОВАНИЯ COOKIE</h2>

<p>Политика использования cookie (далее – Политика) описывает типы Cookie, цели их использования, как именно Компания обрабатывает данные, собранные в процессе использования Посетителями веб-сайта %setup_domain, и способы, с помощью которых можно отказаться от обработки Cookie, и способы, с помощью которых можно отказаться от обработки Cookie.</p>

<p>1.	Термины и определения</p>
<p>В Политике используются следующие термины:</p>

<p>Компания – %firm_name, ИНН %firm_inn, расположенное по адресу: %firm_address.</p>
<p>Посетитель сайта (Посетитель) – лицо, посетившее и использующее Сайт.</p>
<p>Сайт – совокупность программных и аппаратных средств для ЭВМ, обеспечивающих публикацию для всеобщего обозрения информации и данных, объединенных общим целевым назначением, посредством технических средств, применяемых для связи между ЭВМ в сети «Интернет». Сайт находится в сети «Интернет» по адресу: %setup_domain.</p>
<p>Яндекс – Общество с ограниченной ответственностью «ЯНДЕКС», ООО «ЯНДЕКС», ОГРН 1027700229193119021, 119021, г. Москва, ул. Льва Толстого, д. 16.</p>
<p>Cookie – это небольшой фрагмент данных, который Сайт запрашивает у браузера, используемого на компьютере или мобильном устройстве Посетителя. Cookie отражают предпочтения Посетителя или его действия на Сайте, а также сведения об его оборудовании, дате и времени сессии. Сookies хранятся локально на компьютере или мобильном устройстве Посетителя. Посетитель может удалить сохраненные Сookies в настройках соответствующего браузера.</p>
<p>IP-адрес — уникальный сетевой адрес узла в компьютерной сети, построенной по протоколу IP.</p>

<p>2.	Общие положения</p>
<p>2.1.	При первом посещении Сайта с помощью нового браузера или в режиме приватного просмотра Сайта предоставляется баннер, предупреждающий Посетителя об осуществлении сбора Сookies и запрашивающий согласие Посетителя на обработку его Сookies.</p>
<p>2.2.	Нажимая кнопку «Принять» или продолжая пользоваться Сайтом Посетитель предоставляет свое согласие на обработку его Сookies, а также подтверждает согласие с положениями Политики. Продолжение пользоваться Сайтом означает осуществление Посетителем перехода по любой ссылке, размещенной на Сайте, или нажатие любой кнопки на Сайте, а также просмотр контента на любой странице Сайта</p>

<p>2.3.	Посетитель может отказаться от использования Сookies в настройках своего браузера (ознакомиться с данной возможностью можно в разделе «Справка» соответствующего браузера). В таком случае Сайт будет использовать только те Cookie, которые строго необходимы для его функционирования и предлагаемых им сервисов, однако такой отказ может привести к некорректной работе Сайта</p>
<p>2.4.	Политика применяется только к Сайту. Компания не контролирует и не несет ответственность за сайты третьих лиц, на которые Посетитель может перейти по ссылкам, доступным на Сайте.</p>

<p>3.	Обработка данных на Сайте</p>
<p>3.1.	Политика устанавливает обязательства Компании по неразглашению и обеспечению режима защиты конфиденциальности данных Посетителя, которые Компания может получить во время посещения Посетителем Сайта.</p>
<p>3.2.	Компания защищает данные, которые автоматически передаются ей при посещении Посетителем страниц Сайта, на которых установлен статистический скрипт системы («пиксель») в объеме:</p>
<ul>
    <li>IP адрес;</li>
    <li>информация о браузере и адрес страницы (или иной программе, которая осуществляет доступ к показу Сайта);</li>
    <li>время доступа;</li>
    <li>реферер (адрес предыдущей страницы);</li>
    <li>иная информация из Cookie (в зависимости от вида Cookie, приведенного в разделе 4 Политики).</li>
</ul>
<p>3.3.	На Сайте реализован сервис веб-аналитики «Яндекс.Метрика», предоставляемый Яндекс на следующих условиях:</p>
<p>3.3.1.	Сервис веб-аналитики «Яндекс.Метрика» использует Cookie;</p>
<p>3.3.2.	Информация об использовании Сайта Посетителем, собранная при помощи Cookie, подлежит передаче Яндексу и хранится на серверах Яндекса, расположенных в Российской Федерации. Яндекс обрабатывает полученную информацию для оценки использования Сайта Посетителем и составления отчетов о деятельности Сайта.</p>
<p>3.3.3.	Яндекс обрабатывает полученную информацию в порядке, установленном:</p>
<ul>
    <li>Политикой использования файлов cookie, размещенной в сети «Интернет» по адресу: https://yandex.ru/legal/cookies_policy;</li>
    <li>Условиями  использования  сервиса  «Яндекс.Метрика»,  размещенными  в  сети «Интернет» по адресу: https://yandex.ru/legal/metrica_termsofuse;</li>
    <li>Политикой конфиденциальности, размещенной в сети «Интернет» по адресу: https://yandex.ru/legal/confidential.
        Продолжая пользоваться Сайтом Посетитель соглашается на обработку данных о Посетителе Яндексом в порядке и целях, указанных в п. 3.3. Политики.</li>
</ul>

<p>4.	Виды Cookie, используемые Компанией</p>
<p>4.1.	Сессионные</p>
<p>Такие Cookie существуют только во временной памяти в течение времени, когда Посетитель находится на странице Сайта. Браузеры обычно удаляют сессионные Cookie после того, как Посетитель закрывает окно Сайта. Сессионные Cookie позволяют Сайту помнить информацию о выборе Посетителя на предыдущей странице Сайте, чтобы избежать необходимости повторного ввода информации.</p>
<p>4.2.	Постоянные.</p>
<p>Сookies, которые хранятся на компьютере Посетителя и не удаляются при закрытии браузера. Постоянные Сookies могут сохранять пользовательские настройки для Сайта, позволяя использовать эти предпочтения в будущих сеансах просмотра. Такие Cookie позволяют идентифицировать Посетителя как уникального пользователя Сайта, и при возвращении на Сайт помогают вспомнить информацию о Посетителе и ранее совершенных действиях.</p>
<p>4.3.	Статистические.</p>
<p>Такие Cookie включают в себя информацию о том, как Посетитель использует Сайт. Например, какие страницы Посетитель посещает, по каким ссылкам переходит. Главная цель таких Cookie — улучшение функций Сайта.</p>
<p>4.4.	Обязательные.
<p>Минимальный набор Cookie, использование которых необходимо для корректной работы Сайта.</p>

<p>5.	Цели сбора данных Посетителя</p>
<p>5.1.	Cookie используются Компанией в целях улучшения работы Сайта.</p>
<p>5.2.	Сведения о действиях Посетителей обрабатываются для совершенствования продуктов и услуг Компании, определения предпочтений Посетителей, предоставления целевой информации по продуктам и услугам Компании.</p>

<p>6.	Дополнительные условия</p>
<p>6.1.	Владелец Сайта вправе вносить изменения в Политику.</p>
<p>6.2.	Новая Политика вступает в силу с даты ее размещения на Сайте, если иное не предусмотрено новой редакцией Политики.</p>
<p>6.3.	Действующая Политика размещена в сети «Интернет» по адресу: %setup_domain.</p>
<p>6.4.	В случае возникновения вопросов, связанных с обработкой персональных данных Посетителя или реализации прав субъекта персональных данных, Посетитель может связаться с Компанией путем направления запроса в службу поддержки https://%setup_domain. Срок ответа на запрос составляет 10 (десять) рабочих дней.</p>
{/t}