</td></tr><tr><td colspan="2">
<p>{t}С помощью ReadyScript, вы можете организовывать профессиональную тикет-систему поддержки.
Пользователи могут писать письма на ваш Email, ReadyScript будет автоматически скачивать письма
и создавать тикет у вас в поддержке. Идентификация пользователя будет происходить по Email-адресу.
Каждый ответ администратора будет автоматически отправляться на Email пользователя.{/t}</p>

<p>Для организации сборки почты, необходимо насторить профили сборщиков писем.</p>
<a href="{adminUrl do=false mod_controller="support-crawlerctrl"}" class="btn btn-default">Перейти к профилям сборщиков писем</a>